quiz_data = [
    {
        "question": "Что такое Python?",
        "options": [
            "Язык программирования",
            "Тип данных",
            "Музыкальный инструмент",
            "Змея на английском",
        ],
        "correct_option": 0,
    },
    {
        "question": "Какой тип данных используется для хранения целых чисел?",
        "options": ["int", "float", "str", "natural"],
        "correct_option": 0,
    },
    {
        "question": "Что такое переменная в программировании?",
        "options": [
            "Место для хранения данных",
            "Тип данных",
            "Функция",
            "Синтаксическая ошибка",
        ],
        "correct_option": 0,
    },
    {
        "question": "Какой символ используется для начала комментария в Python?",
        "options": ["#", "//", "/*", "--"],
        "correct_option": 0,
    },
    {
        "question": "Что такое функция в Python?",
        "options": [
            "Объект, который выполняет задачи",
            "Специальный тип переменной",
            "Цикл",
            "Структура данных",
        ],
        "correct_option": 0,
    },
    {
        "question": "Какой метод используется для добавления элемента в список?",
        "options": ["append()", "add()", "insert()", "extend()"],
        "correct_option": 0,
    },
    {
        "question": "Что такое библиотека в контексте Python?",
        "options": [
            "Набор модулей и функций для использования",
            "Тип данных",
            "Переменная",
            "Специальная функция",
        ],
        "correct_option": 0,
    },
    {
        "question": "Какой из следующих типов данных является изменяемым?",
        "options": ["list", "int", "str", "tuple"],
        "correct_option": 0,
    },
    {
        "question": "Для чего используется условное выражение if?",
        "options": [
            "Для выполнения кода в зависимости от условия",
            "Для определения переменной",
            "Для создания функции",
            "Для выполнения цикла",
        ],
        "correct_option": 0,
    },
]
